GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/drivers/mg323.c
	sprintf( buf, "AT^SICS=%d,user,%s\r\n", i, gsm_apn.user );
	SendATCmdWaitRespStr( buf, RT_TICK_PER_SECOND, "OK", 1 );

	sprintf( buf, "AT^SICS=%d,apn,%s\r\n", i, gsm_apn.apn );
	SendATCmdWaitRespStr( buf, RT_TICK_PER_SECOND, "OK", 1 );

	sprintf( buf, "AT^SISS=%d,srvType,socket\r\n", i );
	SendATCmdWaitRespStr( buf, RT_TICK_PER_SECOND, "OK", 1 );

	sprintf( buf, "AT^SISS=%d,srvType,socket\r\n", i );
	SendATCmdWaitRespStr( buf, RT_TICK_PER_SECOND, "OK", 1 );

	gsmstate = GSM_DATA;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static void gsm_send( void* parameter )
{
/*此处可通过rt_thread_self获取线程信息*/
}

ALIGN( RT_ALIGN_SIZE )
static char thread_gsm_stack[512];
struct rt_thread thread_gsm;


/***********************************************************
* Function:       rt_thread_entry_gsm
* Description:    接收处理，状态转换
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static void rt_thread_entry_gsm( void* parameter )
{
	rt_tick_t		curr_ticks;
	rt_err_t		res;
	unsigned char	ch, next;

/*gsm的状态切换*/
	while( 1 )
	{
		curr_ticks = rt_tick_get( );
		switch( gsmstate )
		{
			case GSM_IDLE:
				break;
			case GSM_POWERON:                                   /*上电过程中，控制IO的操作放在此处，如何保证时间的可靠*/
				if( tid_gsm_subthread == RT_NULL )
				{
					tid_gsm_subthread = rt_thread_create( "pwron",gsm_poweron, (void*)1,512,25,5);
					rt_kprintf("\r\ntid_gsm_subthread=%p\r\n",tid_gsm_subthread);
					if( tid_gsm_subthread != RT_NULL )
					{
						rt_thread_startup( tid_gsm_subthread );
					}
				}
				break;
			case GSM_POWEROFF:                                  /*断电电过程中，控制IO的操作放在此处，如何保证时间的可靠*/
				if( tid_gsm_subthread == RT_NULL )
				{
					tid_gsm_subthread = rt_thread_create( "pwroff",gsm_poweroff, (void*)1,512,25,5 );
					if( tid_gsm_subthread != RT_NULL )
					{
						rt_thread_startup( tid_gsm_subthread );
					}
				}
				break;
			case GSM_AT:
				if( fConnectToGprs )
				{
					gsmstate = GSM_PPP; /*切换链接*/
				}
				break;
			case GSM_PPP:
				if( tid_gsm_subthread == RT_NULL )
				{
					tid_gsm_subthread = rt_thread_create( "ppp",gsm_ppp, (void*)1,512,25,5);
					if( tid_gsm_subthread != RT_NULL )
					{
						rt_thread_startup( tid_gsm_subthread );
					}
				}
				break;
			case GSM_DATA:
				break;
		}

/*接收超时判断*/
		res = rt_sem_take( &sem_uart, RT_TICK_PER_SECOND / 10 );    //等待100ms,实际上就是变长的延时,最长100ms
		if( res == -RT_ETIMEOUT )                                   //超时退出，没有数据或接收数据完毕
		{
			if( gsm_rx_wr )
			{
				gsmrx_cb( gsm_rx, gsm_rx_wr );
				gsm_rx_wr = 0;
			}
		}
		else //收到数据,理论上1个字节触发一次,这里没有根据收到的<CRLF>处理，而是等到超时统一处理
		{
			while(rt_ringbuffer_getchar(&rb_uart4_rx,&ch)==1)
			{
				gsm_rx[gsm_rx_wr++] = ch;
				if( gsm_rx_wr == GSM_RX_SIZE )
				{
					gsm_rx_wr = 0;
				}
				gsm_rx[gsm_rx_wr] = 0;
			}
		}
	}
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void gsm_init( T_GSM_OPS *gsm_ops )
{
	rt_thread_t tid;

/*初始化串口接收缓冲区*/
	rt_ringbuffer_init(&rb_uart4_rx,uart4_rxbuf,UART4_RX_SIZE);	

	rt_sem_init( &sem_uart, "sem_uart", 0, 0 );
	rt_sem_init( &sem_gsmrx, "sem_gsmrx", 0, 0 );

	rt_thread_init( &thread_gsm,
	                "gsm",
	                rt_thread_entry_gsm,
	                RT_NULL,
	                &thread_gsm_stack[0],
	                sizeof( thread_gsm_stack ), 7, 5 );
	rt_thread_startup( &thread_gsm );

	dev_gsm.type	= RT_Device_Class_Char;
	dev_gsm.init	= mg323_init;
	dev_gsm.open	= mg323_open;
	dev_gsm.close	= mg323_close;
	dev_gsm.read	= mg323_read;
	dev_gsm.write	= mg323_write;
	dev_gsm.control = mg323_control;

	dev_gsm.user_data = &gsm_ops_default;
	if( gsm_ops != NULL )
	{
		dev_gsm.user_data = gsm_ops;
	}

	rt_device_register( &dev_gsm, "gsm", RT_DEVICE_FLAG_RDWR );
	rt_device_init( &dev_gsm );
}



#ifdef TEST_GSM


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
rt_err_t gsm_open( void )
{
	return mg323_open( &dev_gsm, RT_DEVICE_OFLAG_RDWR );
}

FINSH_FUNCTION_EXPORT( gsm_open, open gsm );


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
rt_err_t gsm_close( void )
{
	return mg323_close( &dev_gsm );
}

FINSH_FUNCTION_EXPORT( gsm_close, close gsm );

/*设置链接的socket参数*/
rt_err_t gsm_control_socket( uint8_t linkno, char type, char *ip, uint32_t port )
{
	return mg323_control( &dev_gsm, 0, NULL );
}

FINSH_FUNCTION_EXPORT( gsm_control_socket, control gsm );


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
rt_size_t gsm_write( char *sinfo )
{
	return mg323_write( &dev_gsm, 0, sinfo, strlen( sinfo ) );
}

FINSH_FUNCTION_EXPORT( gsm_write, write gsm );

#endif
#endif

/************************************** The End Of File **************************************/
